In [1]:
#imports
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split

# NAIVE BAYES ON SOCIAL STATUS

In [307]:
ds = pd.read_csv("Social_Status.csv")
ds

,Unnamed: 0,State,Year,Type_code,Type,Gender,Age_group,Total
0,0,West Bengal,2001,Social_Status,2,Female,0-100+,175
1,1,West Bengal,2001,Social_Status,4,Female,0-100+,435
2,2,West Bengal,2001,Social_Status,1,Female,0-100+,3557
3,3,West Bengal,2001,Social_Status,3,Female,0-100+,175
4,4,West Bengal,2001,Social_Status,0,Female,0-100+,1853
...,...,...,...,...,...,...,...,...
115,115,West Bengal,2012,Social_Status,2,Male,0-100+,149
116,116,West Bengal,2012,Social_Status,4,Male,0-100+,233
117,117,West Bengal,2012,Social_Status,1,Male,0-100+,5451
118,118,West Bengal,2012,Social_Status,3,Male,0-100+,189
119,119,West Bengal,2012,Social_Status,0,Male,0-100+,2658

In [308]:
ds = ds.drop(['Unnamed: 0','State','Year','Type_code','Age_group'],axis='columns')
ds

     Type  Gender  Total
0       2  Female    175
1       4  Female    435
2       1  Female   3557
3       3  Female    175
4       0  Female   1853
..    ...     ...    ...
115     2    Male    149
116     4    Male    233
117     1    Male   5451
118     3    Male    189
119     0    Male   2658

[120 rows x 3 columns]

In [341]:
X = ds.drop(['Gender'],axis = 'columns')
Y = ds.Gender

In [348]:
from sklearn.model_selection import train_test_split 
X_train1, X_test1, y_train1, y_test1 = train_test_split(X, Y, test_size=0.1)

In [349]:
from sklearn.naive_bayes import GaussianNB 
gnb = GaussianNB() 
gnb.fit(X_train1, y_train1)

GaussianNB(priors=None, var_smoothing=1e-09)

In [350]:
y_pred = gnb.predict(X_test1)
from sklearn import metrics 
print("Gaussian Naive Bayes model accuracy(in %):", metrics.accuracy_score(y_test1, y_pred)*100)

Gaussian Naive Bayes model accuracy(in %): 75.0